<?php
return [
    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | such as the size rules. Feel free to tweak each of these messages.
    |
    */
    'accepted'             => ':ຕ້ອງຍອມຮັບເອົາຄຸນລັກສະນະ',
    'active_url'           => ':ແອດທິບິລຕ໌ນີ້ບໍ່ແມ່ນ URL ທີ່ຖືກຕ້ອງ.',
    'after'                => ':ແອດທິບິລຕ໌ຕ້ອງແມ່ນວັນທີຫຼັງຈາກ: ວັນທີ',
    'alpha'                => ':ແອດທິບິລຕ໌ຕ້ອງມີພຽງແຕ່ຕົວອັກສອນເທົ່ານັ້ນ.',
    'alpha_dash'           => ':ແອດທິບິລຕ໌ຕ່າງໆຄວນມີພຽງຕົວອັກສອນ, ຕົວເລກ ແລະ ເຄື່ອງໝາຍ.',
    'alpha_num'            => ':ແອດທິບິລຕ໌ຄວນມີພຽງແຕ່ຕົວອັກສອນ ແລະ ຕົວເລກເທົ່ານັ້ນ.',
    'array'                => ':ແອດທິບິລຕ໌ຕ້ອງເປັນຊຸດ.',
    'before'               => ':ແອດທິບິລຕ໌ຕ້ອງເປັນວັນທີກ່ອນວັນທີ: ວັນທີ.',
    'between'              => [
        'numeric' => ':ແອດທິບິລຕ໌ຕ່າງໆຕ້ອງຢູ່ລະຫວ່າງ: ຂັ້ນຕ່ຳສຸດ -: ສູງສຸດ',
        'file'    => ':ຄຸນນະສົມບັດຕ້ອງມີນ້ຳໜັກລະຫວ່າງ: ນາທີ -: ສູງສຸດກິໂລໄບ',
        'string'  => ':ແອດທິບິລຕ໌ຕ້ອງມີໃນລະຫວ່າງ: ນາທີ - - ຕົວອັກສອນສູງສຸດ',
        'array'   => ':ຄຸນນະສົມບັດຕ້ອງມີລະຫວ່າງ: ນາທີ - ສູງສຸດ',
    ],
    'boolean'              => 'ຟິລດ໌: ແອດທິບິລຕ໌ ຕ້ອງມີມູນຄ່າທີ່ແທ້ຈິງ ຫຼື ບໍ່ຖືກຕ້ອງ.',
    'confirmed'            => 'ການຢືນຢັນ: ແອດທິບິລຕ໌ບໍ່ກົງກັນ.',
    'date'                 => ':ແອດທິບິລຕ໌ບໍ່ແມ່ນວັນທີທີ່ຖືກຕ້ອງ.',
    'date_format'          => ':ຄຸນລັກສະນະບໍ່ກົງກັບຮູບແບບ: ຮູບແບບ',
    'different'            => ':ຄຸນລັກສະນະ y: ອື່ນໆ...ຈະຕ້ອງແຕກຕ່າງກັນ.',
    'digits'               => ':ຄຸນລັກສະນະຕ້ອງມີ: ຕົວເລກດິຈິຕອນ',
    'digits_between'       => ':ຄຸນລັກສະນະຕ້ອງມີລະຫວ່າງ: ນາທີ ແລະ: ຈຳນວນສູງສຸດ',
    'distinct'             => 'ຟິລດ໌: ຄຸນລັກສະນະມີຄຸນຄ່າທີ່ຊ້ຳກັນ',
    'email'                => ':ແອດທິບິລຕ໌ບໍ່ແມ່ນອີເມວທີ່ຖືກຕ້ອງ',
    'exists'               => ':ແອດທິບິລຕ໌ບໍ່ຖືກຕ້ອງ.',
    'filled'               => 'ຟິລດ໌: ແອດທິບິລຕ໌ ເປັນສິ່ງຈຳເປັນ.',
    'image'                => ':ຄຸນລັກສະນະຕ້ອງເປັນຮູບພາບ.',
    'in'                   => ':ຄຸນລັກສະນະບໍ່ຖືກຕ້ອງ.',
    'in_array'             => 'ແອດທິບິລຕ໌ ຟິລດ໌: ບໍ່ມີຢູ່ໃນ: ອື່ນໆ',
    'integer'              => ':ຄຸນລັກສະນະຕ້ອງເປັນຈຳນວນເຕັມ.',
    'ip'                   => ':ແອດທິບິລຕ໌ຕ້ອງເປັນທີ່ຢູ່ IP ທີ່ຖືກຕ້ອງ.',
    'json'                 => 'ຟິລດ໌: ແອດທິບິລຕ໌ຕ້ອງສະຕິງ JSON ທີ່ຖືກຕ້ອງ.',
    'max'                  => [
        'numeric' => ':ຄຸນລັກສະນະບໍ່ສາມາດໃຫຍ່ກວ່າ: ສູງສຸດ',
        'file'    => ':ຄຸນນະສົມບັດບໍ່ສາມາດໃຫຍ່ກວ່າ: ສູງສຸດ KB.',
        'string'  => ':ຄຸນລັກສະນະບໍ່ຕ້ອງເກີນ: ຕົວອັກສອນສູງສຸດ',
        'array'   => ':ຄຸນລັກສະນະບໍ່ຕ້ອງເກີນອົງປະກອບ: ສູງສຸດ',
    ],
    'mimes'                => ':ຄຸນລັກສະນະຕ້ອງເປັນຮູບແບບໄຟລ໌ :: ຄ່າ',
    'min'                  => [
        'numeric' => 'ຂະໜາດຄຸນລັກສະນະ: ຕ້ອງມີຢ່າງໜ້ອຍ: ນາທີ',
        'file'    => 'ຂະໜາດຄຸນລັກສະນະ: ຕ້ອງມີຢ່າງໜ້ອຍ: min kilobytes',
        'string'  => ':ຄຸນລັກສະນະຕ້ອງມີຕົວອັກສອນຢ່າງໜ້ອຍ: ນາທີ',
        'array'   => ':ຄຸນລັກສະນະຕ້ອງມີຢ່າງໜ້ອຍ: ສ່ວນປະກອບຕ່ຳ ສຸດ',
    ],
    'not_in'               => ':ຄຸນລັກສະນະບໍ່ຖືກຕ້ອງ.',
    'numeric'              => ':ຄຸນລັກສະນະຕ້ອງເປັນຕົວເລກ.',
    'present'              => 'ຟິລດ໌: ຄຸນລັກສະນະຕ້ອງມີຢູ່.',
    'regex'                => 'ຮູບແບບຂອງ: ຄຸນລັກສະນະບໍ່ຖືກຕ້ອງ.',
    'required'             => 'ຟິລດ໌: ຄຸນລັກສະນະ ຈຳເປັນ.',
    'required_if'          => 'ຟິລດ໌: ຄຸນລັກສະນະແມ່ນຈຳເປັນເມື່ອ: ອື່ນໆແມ່ນ: ມູນຄ່າ',
    'required_unless'      => 'ຟິລດ໌ແອດທິບິລຕ໌: ຕ້ອງການເວັ້ນເສຍແຕ່ວ່າ: ອື່ນໆແມ່ນຢູ່ໃນ:',
    'required_with'        => 'ຟິລດ໌ແອດທິບິລຕ໌: ຕ້ອງການເມື່ອ: ຄ່າມີຢູ່',
    'required_with_all'    => 'ຟິລດ໌ແອດທິບິລຕ໌: ຕ້ອງການເມື່ອ: ຄ່າມີຢູ່ທັງໝົດ',
    'required_without'     => 'ຟິລດ໌ແອດທິບິລຕ໌: ຕ້ອງການໃນເວລາທີ່: ບໍ່ມີຄ່າ',
    'required_without_all' => 'ຟິລດ໌ແອດທິບິລຕ໌: ແມ່ນຈຳເປັນເມື່ອບໍ່ມີຄ່າ.',
    'same'                 => ':ຄຸນລັກສະນະ Y: ສິ່ງອື່ນໆຈະຕ້ອງກົງກັນ',
    'size'                 => [
        'numeric' => 'ຂະໜາດຄຸນນະສົມບັດ: ຕ້ອງແມ່ນ: ຂະໜາດ',
        'file'    => 'ຂະໜາດຄຸນນະສົມບັດ: ຕ້ອງແມ່ນ: ຂະໜາດ KB',
        'string'  => ':ຄຸນລັກສະນະຕ້ອງມີ: ຂະໜາດຕົວອັກສອນ',
        'array'   => ':ຕ້ອງມີຄຸນສົມບັດ: ອົງປະກອບຂະໜາດ',
    ],
    'string'               => 'ຟິລດ໌: ຄຸນລັກສະນະຕ້ອງເປັນສະຕິງຕົວອັກຂະລະ',
    'timezone'             => 'ຄຸນລັກສະນະ: ຕ້ອງເປັນເຂດທີ່ຖືກຕ້ອງ',
    'unique'               => ':ແອດທິບິລຕ໌ໄດ້ຖືກລົງທະບຽນແລ້ວ.',
    'url'                  => 'ຮູບແບບ: ແອດທິບິລຕ໌ບໍ່ຖືກຕ້ອງ.',
    'captcha'              => 'ລະຫັດແຈ້ງລົບຄຳຄິດເຫັນທີ່ປ້ອນບໍ່ຖືກຕ້ອງ.',
    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */
    'custom'               => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],
    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */
    'attributes'           => [
        'name'                  => 'ຊື່',
        'username'              => 'ຜູ້ໃຊ້ງານ',
        'email'                 => 'ອີເມວ',
        'first_name'            => 'ຊື່​ແທ້',
        'last_name'             => 'ນາມສະກຸນ',
        'password'              => 'ລະຫັດຜ່ານ',
        'password_confirmation' => 'ລະຫັດຢືນຢັນ',
        'city'                  => 'ເມືອງ',
        'country'               => 'ປະເທດ',
        'address'               => 'ທີ່ຢູ່',
        'phone'                 => 'ເບີໂທ',
        'mobile'                => 'ເບີໂທມືຖື',
        'age'                   => 'ອາຍຸ',
        'sex'                   => 'ຄວາມສຳພັນ',
        'gender'                => 'ເພດ',
        'year'                  => 'ປີ',
        'month'                 => 'ເດືອນ',
        'day'                   => 'ວັນ',
        'hour'                  => 'ຊົ່ວໂມງ',
        'minute'                => 'ນາທີ',
        'second'                => 'ວິນາທີ',
        'title'                 => 'ຫົວເລືອງ',
        'body'                  => 'ເນື້ອຫາ',
        'description'           => 'ລາຍລະອຽດ',
        'excerpt'               => 'ສານສະກັດ',
        'date'                  => 'ວັນທີ',
        'time'                  => 'ເວລາ',
        'subject'               => 'ບົດເລື່ອງ',
        'message'               => 'ຂໍ້ຄວາມ',
        'required'              => 'ຕ້ອງການ',
    ],
];
